app/controllers/microposts_controller.rb

  def index
    @microposts = Micropost.all
---
SELECT "microposts".* FROM "microposts" ORDER BY "microposts"."created_at" DESC

  def show
    id = params[:id]
		@micropost = Micropost.find(id)
---
SELECT  "microposts".* FROM "microposts" WHERE "microposts"."id" = ? LIMIT ?  [["id", 980190962], ["LIMIT", 1]]

  def edit
    id = params[:id]
		@micropost = Micropost.find(id)
---
SELECT  "microposts".* FROM "microposts" WHERE "microposts"."id" = ? LIMIT ?  [["id", 980190962], ["LIMIT", 1]]

    def set_micropost
      @micropost = Micropost.find(params[:id])
---
SELECT  "microposts".* FROM "microposts" WHERE "microposts"."id" = ? ORDER BY "microposts"."created_at" DESC LIMIT ?  [["id", 295], ["LIMIT", 1]]